 
import streamlit as st

st.set_page_config(page_title="About", page_icon="ℹ️")
st.title("ℹ️ About This App")
st.write("""

ในปัจจุบัน รถยนต์มือสองได้รับความนิยมเพิ่มขึ้นเนื่องจากราคาที่เข้าถึงได้ง่ายกว่าและสามารถใช้งานได้อย่างมีประสิทธิภาพ 
อย่างไรก็ตาม การประเมินราคาขายต่อยังคงซับซ้อนเนื่องจากขึ้นอยู่กับหลายปัจจัย เช่น ปีที่ผลิต ระยะทางการใช้งาน ยี่ห้อ ประวัติการบำรุงรักษา และจำนวนเจ้าของก่อนหน้า เป็นต้น 
โครงงานนี้มีวัตถุประสงค์เพื่อพัฒนาตัวแบบทำนายราคารถยนต์มือสองโดยใช้ขั้นตอนวิธี CatBoost และ LightGBM ซึ่งอยู่ในกลุ่มโครงสร้างต้นไม้ (Tree-Based Models) 
โดยใช้ตัวแปรเชิงหมวดหมู่ 6 ตัว  ตัวแปรเชิงตัวเลข 5 ตัวเป็นข้อมูลนำเข้า และตัวแปรตาม 1 ตัว 
เพื่อตรวจสอบประสิทธิภาพของตัวแบบโดยใช้ตัวชี้วัด MAE, RMSE และ R² 
ผลการศึกษาแสดงให้เห็นว่า ขั้นตอนวิธี CatBoost ให้ความแม่นยำสูงสุดในการทำนายราคารถยนต์มือสอง 
และสามารถนำไปพัฒนาเป็นระบบต้นแบบในรูปแบบ เว็บแอปพลิเคชัน ทำให้ผู้ซื้อและผู้ขายสามารถประเมินราคาได้อย่างสะดวก รวดเร็ว และมีความน่าเชื่อถือ

- จัดทำโดย: นางสาวธัญพิชชา ศรีเพชร, นางสาววรฤทัย ตานำคำ
- อาจารณ์ที่ปรึกษา: ผศ.ดร.อานิษา ราศรี
- กันยายน: 2025
""")
